Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/DoorControl/AccessDoor/General.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
  xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:tdc="http://www.onvif.org/ver10/doorcontrol/wsdl">
  <soap:Header/>
  <soap:Body>
    <tdc:AccessDoor>
      <tdc:Token>tokenDoor1</tdc:Token>
      <!--Optional-->
      <tdc:UseExtendedTime>true</tdc:UseExtendedTime>
      <!--Optional-->
      <tdc:AccessTime>PT30S</tdc:AccessTime>
      <!--Optional-->
      <tdc:OpenTooLongTime>PT10S</tdc:OpenTooLongTime>
      <!--Optional-->
      <tdc:PreAlarmTime>PT10S</tdc:PreAlarmTime>
      <!--Optional-->
      <tdc:Extension>
        <!--You may enter ANY elements at this point-->
      </tdc:Extension>
    </tdc:AccessDoor>
  </soap:Body>
</soap:Envelope>